CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/projects/lpc40xx_freertos/l5_application/main.c
#include "FreeRTOS.h"
#include "board_io.h"
#include "common_macros.h"
#include "gpio_isr.h"
#include "gpio_lab.h"
#include "lpc40xx.h"
#include "semphr.h"
#include <stdint.h>
#include <stdio.h>
//#include "lpc_peripherals.h"
#include "adc.h"
#include "gpio.h"
#include "periodic_scheduler.h"
#include "pwm1.h"
#include "queue.h"
#include "sj2_cli.h"
#include "ssp2.h"
#include "task.h"

/// 'static' to make these functions 'private' to this file
// static void create_blinky_tasks(void);
// static void create_uart_task(void);
// static void blink_task(void *params);
// static void uart_task(void *params);
// static SemaphoreHandle_t binary_semaphore;
// static SemaphoreHandle_t mutex;
// static const uint32_t pin26 = (1 << 26); // 0x02000000? LED1后面写了: P2_3; LED2后面写了: P1_26
static SemaphoreHandle_t switch_press_indication;
static SemaphoreHandle_t switch_pressed_signal;

/// lab 2 part 0
#if 0
void lab2_led_task(void *pvParameters) {
  // Choose one of the onboard LEDS by looking into schematics and write code for the below
  // 0) Set the IOCON MUX function(if required) select pins to 000
  LPC_IOCON->P2_3 &= (7 << 0);
  // 0x1000100101 & 0x000 = 0x1000100000
  // 1) Set the DIR register bit for the LED port pin, 1:output, 0:input
  LPC_GPIO2->DIR |= (1 << 4); //0001 << 4 = 10000;
  // 0001 << 3 = 1000; which port to use does not matter
  while (true) {
    // 2) Set PIN register bit to 0 to turn ON LED (led may be active low)
    LPC_GPIO2->SET = (1 << 3);
    vTaskDelay(500);

    // 3) Set PIN register bit to 1 to turn OFF LED
    LPC_GPIO2->CLR = (1 << 3);
    vTaskDelay(500);
  }
}
#endif

/// lab 2 part 1
#if 0
static void lab2_led_task(void *pvParameters) {
  // Set the IOCON MUX function(if required) select pins to 000
  LPC_IOCON->P2_3 &= ~(7 << 0); //~0111 = 1000
  // port_pin_s led3 = {1, 26};
  gpiox__set_as_output(3);
  while (1) {
    // turn the LED on using CLR register
    gpiox__set_high(3);
    vTaskDelay(500); // delay for batter result showing

    // turn the LED off using SET register
    gpiox__set_low(3);
    vTaskDelay(500);
  }
}
#endif

/// lab 2 part 2 blink together
#if 0
void lab2_led_task(void *task_parameter) {
  // Type-cast the paramter that was passed from xTaskCreate()
  port_pin_s *led_num = (port_pin_s *)(task_parameter);
  LPC_IOCON->P2_3 &= ~(7 << 0);
  LPC_IOCON->P1_26 &= ~(7 << 0);
  gpiox__set_as_output(*led_num);
  while (true) {
    // do: insert code here to blink an LED
    // Hint: Also use vTaskDelay() to sleep the task
    // turn on
    gpiox__set_high(*led_num);
    vTaskDelay(500);
    // turn off
    gpiox__set_low(*led_num);
    vTaskDelay(500);
  }
}
#endif

/// lab 2 part 2 blink separate
#if 0
void lab2_led_task0(void *task_parameter) {
  // Type-cast the paramter that was passed from xTaskCreate()
  port_pin_s *led_num = (port_pin_s *)(task_parameter);
  LPC_IOCON->P2_3 &= ~(7 << 0);
  gpiox__set_as_output(*led_num);
  while (true) {
    gpiox__set_high(*led_num);
    vTaskDelay(500);
    // turn off
    gpiox__set_low(*led_num);
    vTaskDelay(500);
  }
}
void lab2_led_task1(void *task_parameter) {
  // Type-cast the paramter that was passed from xTaskCreate()
  port_pin_s *led_num = (port_pin_s *)(task_parameter);
  LPC_IOCON->P1_26 &= ~(7 << 0);
  gpiox__set_as_output(*led_num);
  while (true) {
    vTaskDelay(500);
    gpiox__set_high(*led_num);
    vTaskDelay(500);
    // turn off
    gpiox__set_low(*led_num);
    vTaskDelay(500);
  }
}
#endif

/// lab 2 part3
#if 0
void lab2_led_task(void *task_parameter) {
  // LPC_IOCON->P2_3 &= ~(7 << 0);
  const port_pin_s *led_num = (port_pin_s *)(task_parameter);
  gpiox__set_as_output(*led_num);
  while (true) {
    printf("entering the led function\n");
    // gpiox__set_high(*led_num);
    // Note: There is no vTaskDelay() here, but we use sleep mechanism while waiting for the binary semaphore
    if (xSemaphoreTake(switch_press_indication, 1000)) {
      // Blink the LED
      printf("Blinking\n");
      gpiox__set_high(*led_num);
      vTaskDelay(500);
      gpiox__set_low(*led_num);
      vTaskDelay(500);
    } else {
      puts("Timeout: No switch press indication for 1000ms");
    }
  }
}

void switch_task(void *task_parameter) {
  port_pin_s *switch0 = (port_pin_s *)(task_parameter);
  // gpiox__set_as_input(*switch0);
  // printf("level: %d", gpiox__get_level(*switch0));
  while (true) {
    // DO: If switch pressed, set the binary semaphore
    if (gpiox__get_level(*switch0)) {
      xSemaphoreGive(switch_press_indication);
      vTaskDelay(100);
    }
    // Task should always sleep otherwise they will use 100% CPU
    // This task sleep also helps avoid spurious semaphore give during switch debeounce
  }
}
#endif

/// lab 3 part 0
#if 0
void gpio_interrupt(void) {
  // a) Clear Port0/2 interrupt using CLR0 or CLR2 registers
  LPC_GPIOINT->IO0IntClr = (1 << 29);    // clr the INT register for the switch's Port/Pin
                                         // (the switch that trigger interrupt)
  static port_pin_s test_led2 = {1, 24}; // LED2
  static port_pin_s test_led1 = {1, 26}; // LED1

  // b) Use fprintf(stderr) or blink and LED here to test your ISR
  LPC_IOCON->P1_26 &= ~(7 << 0);
  gpiox__set_as_output(test_led1);
  gpiox__set_high(test_led1);
  delay__ms(150);
  gpiox__set_low(test_led1);
  delay__ms(150);
  fprintf(stderr, "HEY THERE!\n");
}
#endif

/// lab 3 part 1
#if 0
void gpio_interrupt2(void) {
  fprintf(stderr, "Calling ISR...");
  xSemaphoreGiveFromISR(switch_pressed_signal, NULL);
  LPC_GPIOINT->IO0IntClr = (1 << 30); // clr the INT register for the switch's Port/Pin
                                      // (the switch that trigger interrupt)
}
void sleep_on_sem_task(void *p) {
  const port_pin_s *sem_led = (port_pin_s *)(p);
  gpiox__set_as_output(*sem_led);
  while (1) {
    if (xSemaphoreTake(switch_pressed_signal, 1000000)) {
      fprintf(stderr, "Servicing Interrupt\n");
      gpiox__set_high(*sem_led);
      delay__ms(150);
      gpiox__set_low(*sem_led);
      delay__ms(150); // blinking LED
      // vTaskDelay(100);
    }
    // Use xSemaphoreTake with forever delay and blink an LED when you get the signal
  }
}
#endif

/// lab 3 part 2
#if 0
static SemaphoreHandle_t switch_pressed_signal_hw3_part2_30;
static SemaphoreHandle_t switch_pressed_signal_hw3_part2_31;
void gpio_interrupt_part2_0(void) { xSemaphoreGiveFromISR(switch_pressed_signal_hw3_part2_30, NULL); }
void gpio_interrupt_part2_1(void) { xSemaphoreGiveFromISR(switch_pressed_signal_hw3_part2_31, NULL); }
void pin30_isr(void *p) {
  const port_pin_s *sem_led = (port_pin_s *)(p);
  gpiox__set_as_output(*sem_led);
  while (1) {
    if (xSemaphoreTake(switch_pressed_signal_hw3_part2_30, 1000000)) {
      fprintf(stderr, "Servicing Interrupt 1\n");
      gpiox__set_high(*sem_led);
      delay__ms(100);
      gpiox__set_low(*sem_led);
      delay__ms(100); // blinking LED
      gpiox__set_high(*sem_led);
      delay__ms(100);
      gpiox__set_low(*sem_led);
      delay__ms(100); // blinking LED
      // vTaskDelay(100);
    }
    // Use xSemaphoreTake with forever delay and blink an LED when you get the signal
  }
}
void pin31_isr(void *p) {
  const port_pin_s *sem_led = (port_pin_s *)(p);
  gpiox__set_as_output(*sem_led);
  while (1) {
    if (xSemaphoreTake(switch_pressed_signal_hw3_part2_31, 1000000)) {
      fprintf(stderr, "Servicing Interrupt 2\n");
      gpiox__set_high(*sem_led);
      delay__ms(100);
      gpiox__set_low(*sem_led);
      delay__ms(100); // blinking LED
      gpiox__set_high(*sem_led);
      delay__ms(100);
      gpiox__set_low(*sem_led);
      delay__ms(100); // blinking LED
      // vTaskDelay(100);
    }
    // Use xSemaphoreTake with forever delay and blink an LED when you get the signal
  }
}

void main_func(void *p) {
  const port_pin_s *sem_led = (port_pin_s *)(p);
  while (1) {
    // delay__ms(100);
    // T/ODO: Toggle an LED here
    gpiox__set_high(*sem_led);
    delay__ms(250);
    gpiox__set_low(*sem_led);
    delay__ms(250);
  }
}
#endif

/// lab 4 part 0
#if 0
 void pwm_task(void *p) {
  pwm1__init_single_edge(1000);

