CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/projects/lpc40xx_freertos/l5_application/main.c
  // Locate a GPIO pin that a PWM channel will control
  // NOTE You can use gpio__construct_with_function() API from gpio.h
  // TO/DO Write this function yourself
  gpio__construct_with_function(GPIO__PORT_2, 0, 1);

  // We only need to set PWM configuration once, and the HW will drive
  // the GPIO at 1000Hz, and control set its duty cycle to 50%
  pwm1__set_duty_cycle(PWM1__2_0, 50);

  // Continue to vary the duty cycle in the loop
  uint8_t percent = 0;
  while (1) {
    pwm1__set_duty_cycle(PWM1__2_0, percent);

    if (++percent > 100) {
      percent = 0;
    }
    vTaskDelay(100);
  }
}
#endif

/// lab 4 part 1
#if 0
void pin_configure_adc_channel_as_io_pin() {
  LPC_IOCON->P1_31 &= ~(1 << 7); // set pin to Analog mode
  LPC_IOCON->P1_31 &= ~(7 << 0); // reset IOCON mux
  LPC_IOCON->P1_31 &= (3 << 0);  // route this pin as ADC channel 5
  // gpio__construct_with_function(GPIO__PORT_1, 31, GPIO__FUNCTION_3); /// LPC_IOCON->P1_31 &= ~(1 << 7);
}
void adc_task(void *p) {
  adc__initialize();

  // TODO This is the function you need to add to adc.h
  // You can configure burst mode for just the channel you are using
  adc__enable_burst_mode(1);
  adc__set_active_channel(ADC__CHANNEL_5);
  // LPC_ADC->CR &= ~(0xFF << 0); // clear all channel.

  // Configure a pin, such as P1.31 with FUNC 011 to route this pin as ADC channel 5
  // You can use gpio__construct_with_function() API from gpio.h
  pin_configure_adc_channel_as_io_pin(); // TODO You need to write this function

  while (1) {
    // Get the ADC reading us
    // ing a new routine you created to read an ADC burst reading
    // TODO: You need to write the implementation of this function
    const uint16_t adc_value = adc__get_channel_reading_with_burst_mode(ADC__CHANNEL_5);
    const double adc_voltage = (double)(adc_value) / 4095 * 3.3;
    fprintf(stderr, "ADC value is: %d， ADC voltage is: %.2f v\n", adc_value, adc_voltage);
    vTaskDelay(500);
  }
}
#endif

/// lab 4 part 2
#if 0
// This is the queue handle we will need for the xQueue Send/Receive API
static QueueHandle_t adc_to_pwm_task_queue; // important
void pin_configure_adc_channel_as_io_pin() {
  LPC_IOCON->P1_31 &= ~(1 << 7); // set pin to Analog mode
  LPC_IOCON->P1_31 &= ~(7 << 0); // reset IOCON mux
  LPC_IOCON->P1_31 &= (3 << 0);  // route this pin as ADC channel 5
  // gpio__construct_with_function(GPIO__PORT_1, 31, GPIO__FUNCTION_3); /// LPC_IOCON->P1_31 &= ~(1 << 7);
}
void adc_task(void *p) {
  // NOTE: Reuse the code from Part 1
  adc__initialize();
  adc__enable_burst_mode(1);
  pin_configure_adc_channel_as_io_pin();
  adc__set_active_channel(ADC__CHANNEL_5);
  int adc_reading = 0; // Note that this 'adc_reading' is not the same variable as the one from adc_task
  while (1) {
    // Implement code to send potentiometer value on the queue
    // a) read ADC input to 'int adc_reading'
    adc_reading = adc__get_channel_reading_with_burst_mode(ADC__CHANNEL_5);
    // b) Send to queue: xQueueSend(adc_to_pwm_task_queue, &adc_reading, 0);
    xQueueSend(adc_to_pwm_task_queue, &adc_reading, 0);
    vTaskDelay(100);
  }
}

void pwm_task(void *p) {
  // NOTE: Reuse the code from Part 0
  pwm1__init_single_edge(1000);
  gpio__construct_with_function(GPIO__PORT_2, 0, 1);
  LPC_IOCON->P2_0 &= ~(1 << 7);
  pwm1__set_duty_cycle(PWM1__2_0, 10);
  // uint8_t percent = 0;
  int adc_reading = 0;

  /// extra credit light up RGB LED
  gpio__construct_with_function(GPIO__PORT_2, 1, 1); // configure LPC_P2_1 to be PWN
  LPC_IOCON->P2_1 &= ~(1 << 7);                      // set pin to Analog mode
  gpio__construct_with_function(GPIO__PORT_2, 2, 1); // configure LPC_P2_2 to be PWN
  LPC_IOCON->P2_2 &= ~(1 << 7);                      // set pin to Analog mode
  pwm1__set_duty_cycle(PWM1__2_1, 10);
  pwm1__set_duty_cycle(PWM1__2_2, 10); // configure duty cycle
  static double red = 0, green = 0, blue = 0;
  static double percent = 0;
  // static int duty_cycle = 0;

  while (1) {
    // Implement code to receive potentiometer value from queue
    if (xQueueReceive(adc_to_pwm_task_queue, &adc_reading, 500)) {
      const double adc_voltage = (double)(adc_reading) / 4095 * 3.3;
      fprintf(stderr, "ADC value is: %d， ADC voltage is: %.2f v\n", adc_reading, adc_voltage);
      percent = (double)(adc_reading) / 4095 * 100;
      pwm1__set_duty_cycle(PWM1__2_0, percent);
      int duty = percent;
      /*if (percent <= 30) {
        red = percent / 30 * 100;
      } else if (percent < 60 && percent > 30) {
        red = 100;
        green = percent / 60 * 100;
      } else if (percent <= 100 && percent >= 60) {
        red = 100;
        green = 100;
        blue = (percent - 60) / 40 * 100;
      }*/
      red = percent;
      green = (1 - percent / 100) * 100;
      blue = percent / 1.5;
      /*int R[] = {255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 240, 220, 200, 180,
                 160, 140, 120, 100, 80,  60,  40,  20,  0,   0,   0,   0,   0,   0,   0,   0,   0,
                 0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
                 0,   0,   20,  40,  60,  80,  100, 120, 140, 160, 180, 200, 220, 240};
      int G[] = {0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
                 0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   20,  40,  60,  80,  100, 120, 140,
                 160, 180, 200, 220, 240, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
                 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255};
      int B[] = {0,   20,  40,  60,  80,  100, 120, 140, 160, 180, 200, 220, 240, 255, 255, 255, 255,
                 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255, 255,
                 255, 255, 255, 255, 255, 240, 220, 200, 180, 160, 140, 120, 100, 80,  60,  40,  20,
                 0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0};
      red = (R[duty] / 255) * 100;
      green = (G[duty] / 255) * 100;
      blue = (B[duty] / 255) * 100;
      fprintf(stderr, " duty number is: %.2d\n", duty);*/
      fprintf(stderr, " current duty cycle is: %.2f%%, R:%.2f, G:%.2f, B:%.2f\n", percent, red, green, blue);
      pwm1__set_duty_cycle(PWM1__2_0, red);
      pwm1__set_duty_cycle(PWM1__2_1, green);
      pwm1__set_duty_cycle(PWM1__2_2, blue);
    } else {
      puts("Timeout --> No data received");
    }
    // We do not need task delay because our queue API will put task to sleep when there is no data in the queue
    // vTaskDelay(500);
  }
}
#endif

/// lab 5 part 0
#if 0
// function writen in SSP2.C and SSP2.h
#endif

/// lab 5 part 1
#if 0

void spi_task(void *p) {
  const uint32_t spi_clock_mhz = 12;
  ssp2__lab_init(spi_clock_mhz);

  // From the LPC schematics pdf, find the pin numbers connected to flash memory
  // Read table 84 from LPC User Manual and configure PIN functions for SPI2 pins
  // You can use gpio__construct_with_function() API from gpio.h
  ssp2__init_spi_pins();
  // Note: Configure only SCK2, MOSI2, MISO2.
  // CS will be a GPIO output pin(configure and setup direction)
  // todo_configure_your_ssp2_pin_functions();

  while (1) {
    adesto_flash_id_s id = adesto_read_signature();
    // TODO: printf the members of the 'adesto_flash_id_s' struct
    fprintf(stderr, "manufacturer_id: %p, device_id1: %p, device_id2: %p, external_device_id: %p\n", id.manufacturer_id,
            id.device_id_1, id.device_id_2, id.extended_device_id);
    vTaskDelay(1000);
  }
}
#endif

/// lab 5 part 2
#if 0
xSemaphoreHandle spi_id_mutex_handler;

void spi_id_verification_task(void *p) {
  while (1) {
    if (xSemaphoreTake(spi_id_mutex_handler, 1000)) {
      const adesto_flash_id_s id = adesto_read_signature();

      // When we read a manufacturer ID we do not expect, we will kill this task
      if (id.manufacturer_id != 0x1F) {
        fprintf(stderr, "Manufacturer ID read failure :( \n");
        vTaskSuspend(NULL); // Kill this task
      } else {
        fprintf(stderr, "guard active: manufacturer_id: %p, device_id1: %p, device_id2: %p, external_device_id: %p\n",
                id.manufacturer_id, id.device_id_1, id.device_id_2, id.extended_device_id);
        // vTaskDelay(1000);
      }
      xSemaphoreGive(spi_id_mutex_handler);
    }
  }
}

