CMPE146-MP3-PROJECT/FreeRTOS_MP3_Project/projects/lpc40xx_freertos/l5_application/main.c
/*
void spi_id_verification_task_2(void *p) {
  while (1) {
    if (xSemaphoreTake(spi_id_mutex_handler, 1000)) {
      const adesto_flash_id_s id = adesto_read_signature();

      // When we read a manufacturer ID we do not expect, we will kill this task
      if (id.manufacturer_id != 0x1F) {
        fprintf(stderr, "Manufacturer ID read failure\n");
        vTaskSuspend(NULL); // Kill this task
      } else {
        fprintf(stderr, "guard 2 active: manufacturer_id: %p, device_id1: %p, device_id2: %p, external_device_id: %p\n",
                id.manufacturer_id, id.device_id_1, id.device_id_2, id.extended_device_id);
        // vTaskDelay(1000);
      }
      xSemaphoreGive(spi_id_mutex_handler);
    }
  }
}
*/

// void spi_id_verification_task_2(void *p) { xSemaphoreGive(spi_id_mutex_handler); }

#endif

/// lab 5 part 3 (extra credit)
#if 1

void spi_flash_read_page(void) {
  const uint32_t spi_clock_mhz = 12;
  ssp2__lab_init(spi_clock_mhz);
  ssp2__init_spi_pins();

  uint32_t data_address = 0x005C00;
  uint8_t input_data = 0xBB;
  int write_times = 10;

  while (1) {
    // delay__ms(10);
    const adesto_flash_id_s id = adesto_read_signature();

    // When we read a manufacturer ID we do not expect, we will kill this task
    if (id.manufacturer_id != 0x1F) {
      fprintf(stderr, "Manufacturer ID read failure\n");
      vTaskSuspend(NULL); // Kill this task
    } else {
      fprintf(stderr, "manufacturer_id: %p, device_id1: %p, device_id2: %p, external_device_id: %p\n",
              id.manufacturer_id, id.device_id_1, id.device_id_2, id.extended_device_id);
      // adesto_cs();

      // adesto_cs();
      adesto_write_enable();
      vTaskDelay(1);

      // flash_erase_chip();
      flash_erase_page(data_address);

      adesto_write_enable();
      vTaskDelay(1);

      uint8_t status;
      status = adesto_read_status();
      fprintf(stderr, "device status is: 0x%X \n", status);

      write_to_flash_8bitdata(data_address, input_data, write_times);
      // vTaskDelay(1);
      // ssp2__lab_exchange_byte(input_data);
      adesto_write_disable();
      vTaskDelay(1);
      fprintf(stderr, "data write start from location 0x%X is: 0x%X, for %d times\n", data_address, input_data,
              write_times);

      uint8_t status_0;
      status_0 = adesto_read_status();
      fprintf(stderr, "device status is: 0x%X \n", status_0);

      // start to read the flash
      // adesto_cs();
      uint8_t *result_arrary = adesto_read_arrary_address_input(data_address);
      // vTaskDelay(1);
      // adesto_ds();
      fprintf(stderr,
              "data read start from location 0x%X is: 0x%X, 0x%X, 0x%X, 0x%X, 0x%X, 0x%X, 0x%X, 0x%X, 0x%X, 0x%X\n",
              data_address, result_arrary[0], result_arrary[1], result_arrary[2], result_arrary[3], result_arrary[4],
              result_arrary[5], result_arrary[6], result_arrary[7], result_arrary[8], result_arrary[9]);
      fprintf(stderr, " \n");
      // fprintf(stderr, "data read from location is: %p\n", array_read);
      vTaskDelay(1000);
    }
  }
}

//}
#endif

int main(void) {
/// lab 2 part 0, 1
#if 0
  xTaskCreate(lab2_led_task, "LED", 1024 / sizeof(void *), NULL, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 2 part 2
#if 0
  // This is static such that these variables will be allocated in RAM and not go out of scope
  static port_pin_s led0 = {2, 3};
  static port_pin_s led1 = {1, 26};
  xTaskCreate(lab2_led_task0, "LED0", 1024 / sizeof(void *), &led0, 1, NULL); // &led0 is a task parameter going to
  // vTaskDelay(1500);
  xTaskCreate(lab2_led_task1, "LED1", 1024 / sizeof(void *), &led1, 1, NULL);
  // vTaskDelay(1500);
  vTaskStartScheduler();
  // return 0;
#endif

/// lab 2 part 3
#if 0
  switch_press_indication = xSemaphoreCreateBinary();
  static port_pin_s test_switch = {0, 30}; // SW
  static port_pin_s test_led = {1, 24};    // LED
  // printf("level: %d", gpiox__get_level(test_switch))
  xTaskCreate(switch_task, "test_switch", 1024 / sizeof(void *), &test_switch, 1, NULL);
  // xTaskCreate(switch_task, "test_switch", configMINIMAL_STACK_SIZE, (void *)&test_switch, 1, NULL);
  xTaskCreate(lab2_led_task, "test_led", 1024 / sizeof(void *), &test_led, 1, NULL);
  // xTaskCreate(lab2_led_task, "test_led", configMINIMAL_STACK_SIZE, (void *)&test_led, 1, NULL);
  vTaskStartScheduler();
  return 0;
#endif

/// lab 3 part 0
#if 0
  /// Read Table 95 in the LPC user manual and setup an interrupt on a switch connected to Port0 or Port2
  /// a) For example, choose SW2 (P0_30) pin on SJ2 board and configure as input
  ///Warning: P0.30, and P0.31 require pull-down resistors
  static port_pin_s test_switch = {0, 29}; // SW
  static port_pin_s test_led = {1, 24};    // LED
  gpiox__set_as_input(test_switch);
  // b) Configure the registers to trigger Port0 interrupt (such as falling edge)
  gpiox__trigger_level(test_switch, 0); // set as triggering at the falling edge
  // Install GPIO interrupt function at the CPU interrupt (exception) vector
  // c) Hijack the interrupt vector at interrupt_vector_table.c and have it call our gpio_interrupt()
  //    Hint: You can declare 'void gpio_interrupt(void)' at interrupt_vector_table.c such that it can see this function
  // Most important step: Enable the GPIO interrupt exception using the ARM Cortex M API (this is from lpc40 qxx.h)
  NVIC_EnableIRQ(GPIO_IRQn);
  lpc_peripheral__enable_interrupt(GPIO_IRQn, gpio_interrupt); // gpio_interrupt = ISR
  // Toggle an LED in a loop to ensure/test that the interrupt is entering ane exiting
  // For example, if the GPIO interrupt gets stuck, this LED will stop blinking
  // vTaskStartScheduler();
  while (1) {
    delay__ms(100);
    // T/ODO: Toggle an LED here
    gpiox__set_high(test_led);
    delay__ms(500);
    gpiox__set_low(test_led);
    delay__ms(500);
  }
  // vTaskStartScheduler();
  // return 0;
#endif

/// lab 3 part 1
#if 0
  switch_pressed_signal = xSemaphoreCreateBinary(); // Create your binary semaphore
  static port_pin_s test_switch2 = {0, 30};
  static port_pin_s test_led2 = {1, 24};
  gpiox__set_as_input(test_switch2);
  gpiox__trigger_level(test_switch2, 0);
  // configure_your_gpio_interrupt(); // T/ODO: Setup interrupt by re-using code from Part 0
  NVIC_EnableIRQ(GPIO_IRQn); // Enable interrupt gate for the GPIO
  lpc_peripheral__enable_interrupt(GPIO_IRQn, gpio_interrupt2);
  xTaskCreate(sleep_on_sem_task, "sleep_sem", (512U * 4) / sizeof(void *), &test_led2, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 3 part 2
#if 0
  /* SW0: P1_19; LED0: P2_3;
   * SW1: P1_15; LED1: P1_26;
   * SW2: P0_30; LED2: P1_24;
   * SW3: P0_29; LED3: P1_18;
   */
  switch_pressed_signal_hw3_part2_30 = xSemaphoreCreateBinary();
  switch_pressed_signal_hw3_part2_31 = xSemaphoreCreateBinary();
  static port_pin_s part2_test_switch_2 = {0, 30};
  gpiox__set_as_input(part2_test_switch_2);
  static port_pin_s part2_test_switch_3 = {0, 29};
  gpiox__set_as_input(part2_test_switch_3);

  static port_pin_s test_led_main = {2, 3};
  gpiox__set_as_output(test_led_main);

  static port_pin_s part2_test_led_0 = {1, 26};
  static port_pin_s part2_test_led_1 = {1, 24};

  fprintf(stderr, "Entering...\n");
  gpiox__attach_interrupt(part2_test_switch_2, GPIO_INTR__RISING_EDGE, gpio_interrupt_part2_0);
  gpiox__attach_interrupt(part2_test_switch_3, GPIO_INTR__FALLING_EDGE, gpio_interrupt_part2_1);

  NVIC_EnableIRQ(GPIO_IRQn);
  lpc_peripheral__enable_interrupt(GPIO_IRQn, gpiox__interrupt_dispatcher, "unused");

  xTaskCreate(pin30_isr, "Interrupt 1", (512U * 4) / sizeof(void *), &part2_test_led_0, 2, NULL);
  xTaskCreate(pin31_isr, "Interrupt 2", (512U * 4) / sizeof(void *), &part2_test_led_1, 2, NULL);
  xTaskCreate(main_func, "main function", (512U * 4) / sizeof(void *), &test_led_main, 1, NULL);
  vTaskStartScheduler();
  return 0;
#endif

/// lab 4 part 0
#if 0
  xTaskCreate(pwm_task, "pwm_led", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 4 part 1
#if 0
  xTaskCreate(adc_task, "adc_task", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 4 part 2
#if 0
  // Queue will only hold 1 integer
  adc_to_pwm_task_queue = xQueueCreate(1, sizeof(int)); // important to do this initailize step

  xTaskCreate(adc_task, "adc_task_sending_to_pwm", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  xTaskCreate(pwm_task, "pwm_led", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 5 part 0
#if 0
// function writen in SSP2.C and SSP2.h
#endif

/// lab 5 part 1
#if 0
  xTaskCreate(spi_task, "spi_id_task", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  vTaskStartScheduler();
#endif

/// lab 5 part 2
#if 0
  // TODO: Initialize your SPI, its pins, Adesto flash CS GPIO etc...
  spi_id_mutex_handler = xSemaphoreCreateMutex();
  const uint32_t spi_clock_mhz_part2 = 24;
  ssp2__lab_init(spi_clock_mhz_part2);
  // Create two tasks that will continously read signature
  xTaskCreate(spi_id_verification_task, "spi_id_guard1", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  xTaskCreate(spi_id_verification_task, "spi_id_guard2", (512U * 4) / sizeof(void *), NULL, 1, NULL);

  vTaskStartScheduler();

#endif

/// lab 5 part 3 (extra credit)
#if 1
  xTaskCreate(spi_flash_read_page, "spi_id_task", (512U * 4) / sizeof(void *), NULL, 1, NULL);
  vTaskStartScheduler();
#endif
}
